Repository: NEK-RA/flutter_color_palette
Catalog: lib/l10n/intl_*.arb
Languages: uk_ua

source: Base colors
uk_ua: Базові кольори

source: Shades
uk_ua: Відтінки

source: shade
uk_ua: відтінок

# buildWord
source: build
uk_ua: збірка

# hexValueOfColorString
source: HEX value of color
uk_ua: HEX код кольору

# rgbValueOfColorString
source: RGB value of color
uk_ua: Значення кольору в RGB

# flutterShortVariantString
source: Flutter's short variant
uk_ua: Скорочений варіант в Flutter

# flutterFullVariantString
source: Flutter's full variant
uk_ua: Повний варіант в Flutter

# copiedToClipboardString
source: copied to clipboard
uk_ua: скопійований в буфер обміну

# switchViewTooltip
source: Switch view ( list / grid )
uk_ua: Змінити вигляд ( список / сітка )

source: Settings
uk_ua: Налаштування

source: About
uk_ua: Про додаток

# appLanguageSettingTitle
source: App language
uk_ua: Мова додатку

# currentLanguageString
source: Current language:
uk_ua: Поточна мова:

# systemWordAdjective
source: System
uk_ua: Системна

# darkThemeSettingTitle
source: Dark theme
uk_ua: Темна тема

# darkThemeSettingSubtitle
source: Switch between dark and light themes, the default theme is dark
uk_ua: Перемикання між темною і світлою темою оформлення. За умовчуванням використовується темна

# columnCountSettingTitle
source: Column count
uk_ua: Кількість стовбців сітки

# columnCountSettingSubtitle
source: Currently between 2 and 3 only, used for both colors and shades grid
uk_ua: На даний момент доступні тільки значення від 2 до 3. Вони використовуються для обох сіток

# aboutAppHomepage
source: App homepage
uk_ua: Домашня сторінка

# githubRepoString
source: Github-repository
uk_ua: Github-репозиторій

# aboutAppVersionTitle
source: Version
uk_ua: Версія

# updateFoundTitle
source: Update found
uk_ua: Знайдено оновлення

# publishedAtDate
source: Published: {date}
uk_ua: Опубліковано: {date}

# prereleaseWord
source: Pre-Release
uk_ua: Пререліз

# closeWord
source: Close
uk_ua: Закрити

# openWord
source: Open
uk_ua: Відкрити

# noNewUpdatesTitle
source: Updates not found
uk_ua: Оновлень не знайдено

# usingLatestVersion
source: You are using latest version
uk_ua: Ви використовуєте останню версію

# updateErrorReceivedTitle
source: Error during check for updates
uk_ua: Помилка при перевірці оновлень

# responseStatus
source: Response status: {status}
uk_ua: Статус відповіді: {status}

# responseBody
source: Response body: {body}
uk_ua: Тіло відповіді: {body}

# unexpectedReponseString
source: Unexpected response!
uk_ua: Неочікувана відповідь!

# requiredFieldsNotFoundString
source: Required JSON fields ({fields}) not found!
uk_ua: Необхідні поля JSON({fields}) не знайдені!

# notLikeReleaseJsonString
source: Doesn't look like JSON object of single release!
uk_ua: Не виглядає як JSON-об'єкт окремого релізу!

# aboutAppVersionSubtitle
source: Tap here to check for updates
uk_ua: Натисніть для перевірки оновлень

# notImplementedString
source: NOT IMPLEMENTED YET
uk_ua: ЩЕ НЕ РЕАЛІЗОВАНО

# incorrectColorNameString
source: Incorrect color name!
uk_ua: Колір вказано некоректно

# incorrectColorNameMessage
source: Incorrect color specified. If you see this message when tapped some color in app main screen, please open issue at Github repo. Otherwise there's probably error in URL you opened.
uk_ua: Колір вказано некоректно. Якщо ви бачите це повідомлення натиснувши на якийсь колір з головного екрану додатку, будь ласка повідомте про проблему в Github-репозиторій. В іншому випадку, швидше за все, проблема викликана помилкою в URL-адресі.

source: Accent
uk_ua: Акцент

# goToMainScreen
source: Main screen
uk_ua: На головний екран

# redColor
source: Red
uk_ua: Червоний

# ofRedColor
source: of Red
uk_ua: червоного

# pinkColor
source: Pink
uk_ua: Рожевий

# ofPinkColor
source: of pink
uk_ua: рожевого

# purpleColor
source: Purple
uk_ua: Фіолетовий

# ofPurpleColor
source: of purple
uk_ua: фіолетового

# deepPurpleColor
source: Deep Purple
uk_ua: Темно Фіолетовий

# ofDeepPurpleColor
source: of deep purple
uk_ua: темно фіолетового

# indigoColor
source: Indigo
uk_ua: Індиговий

# ofIndigoColor
source: of indigo
uk_ua: індигового

# blueColor
source: Blue
uk_ua: Синій

# ofBlueColor
source: of blue
uk_ua: синього

# lightBlueColor
source: Light Blue
uk_ua: Блакитний

# ofLightBlueColor
source: of light blue
uk_ua: блакитного

# cyanColor
source: Cyan
uk_ua: Ціановий

# ofCyanColor
source: of cyan
uk_ua: ціанового

# tealColor
source: Teal
uk_ua: Бірюзовий

# ofTealColor
source: of teal
uk_ua: бірюзового

# greenColor
source: Green
uk_ua: Зелений

# ofGreenColor
source: of green
uk_ua: зеленого

# lightGreenColor
source: Light Green
uk_ua: Світло Зелений

# ofLightGreenColor
source: of light green
uk_ua: світло зеленого

# limeColor
source: Lime
uk_ua: Лаймовий

# ofLimeColor
source: of lime
uk_ua: лаймового

# yellowColor
source: Yellow
uk_ua: Жовтий

# ofYellowColor
source: of yellow
uk_ua: жовтого

# amberColor
source: Amber
uk_ua: Бурштиновий

# ofAmberColor
source: of amber
uk_ua: бурштинового

# orangeColor
source: Orange
uk_ua: Помаранчевий

# ofOrangeColor
source: of orange
uk_ua: помаранчового

# deepOrangeColor
source: Deep Orange
uk_ua: Темно Помаранчевий

# ofDeepOrangeColor
source: of deep orange
uk_ua: темно помаранчового

# brownColor
source: Brown
uk_ua: Коричневий

# ofBrownColor
source: of brown
uk_ua: коричневого

# greyColor
source: Grey
uk_ua: Сірий

# ofGreyColor
source: of grey
uk_ua: сірого

# blueGreyColor
source: Blue Grey
uk_ua: Синьо Сірий

# ofBlueGreyColor
source: of blue grey
uk_ua: синьо сірого
